---
kind: type
id: T:Autodesk.Revit.DB.Visual.HardwoodImperfectionsType
source: html/bb36e9f0-0247-295b-a5d8-8e128cf243d6.htm
---
# Autodesk.Revit.DB.Visual.HardwoodImperfectionsType

The enumerated type representing the permitted values for the asset property "HardwoodImperfections" from the "Hardwood" schema.

## Syntax (C#)
```csharp
public enum HardwoodImperfectionsType
```